GHB2/src/Documents/гхб_СпискиДоступаНаЛокацию/гхб_СпискиДоступаНаЛокацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_СпискиДоступаНаЛокацию</name>
  <registerRecords>InformationRegister.гхб_СпискиДоступаНаЛокацию</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеренесеноИзБазыРесурсов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокументаБазыРесурсов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Дивизион</name>
      <type>
        <types>CatalogRef.гхб_Дивизионы</types>
      </type>
    </attributes>
    <attributes>
      <name>Функция</name>
      <type>
        <types>CatalogRef.гхб_Дивизионы</types>
      </type>
    </attributes>
    <attributes>
      <name>Локация</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КритичноНеобходимоРаботатьВОфисе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Гость</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГостьОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата1</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата2</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата3</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата4</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата5</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата6</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата7</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеПеренесенныеИзБазыРесурсов</name>
    <attributes>
      <name>Локация</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СотрудникСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GHB2/src/InformationRegisters/гхб_СпискиДоступаНаЛокацию/гхб_СпискиДоступаНаЛокацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_СпискиДоступаНаЛокацию</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторДокументаБазыРесурсов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Documents/гхб_СпискиДоступаНаЛокацию/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(гхб_Ответственный) Тогда
		гхб_Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	гхб_Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
	КонецЕсли;
	 
	Если (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
		
		Отказ = (ДатаОкончания < НачалоДня(ТекущаяДатаСеанса()));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ПеренесеноИзБазыРесурсов Тогда
		
		Для Каждого Стр Из ДанныеПеренесенныеИзБазыРесурсов Цикл
			
			Если НЕ ЗначениеЗаполнено(Стр.Сотрудник) Тогда
				Продолжить;
			КонецЕсли;
			
			_ТмпДата = Стр.ДатаНачала;
			
			Пока _ТмпДата <= Стр.ДатаОкончания Цикл
				
				_Движение = Движения.гхб_СпискиДоступаНаЛокацию.Добавить();
				_Движение.Дата = _ТмпДата;
				_Движение.Сотрудник = Стр.Сотрудник;
				_Движение.Локация = Стр.Локация;
				_Движение.ИдентификаторДокументаБазыРесурсов = ИдентификаторДокументаБазыРесурсов;
				
				_ТмпДата = гхб_ОбщегоНазначенияКлиентСервер.ДобавитьДеньКДате(_ТмпДата);
				
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
	
		Для Каждого Стр Из Данные Цикл
			
			Если НЕ ЗначениеЗаполнено(Стр.Сотрудник) Тогда
				Продолжить;
			КонецЕсли;
			
			Для ф = 1 По 7 Цикл
				
				Если ЗначениеЗаполнено(Стр["Дата" + ф]) Тогда
					
					_Движение = Движения.гхб_СпискиДоступаНаЛокацию.Добавить();
					_Движение.Дата = гхб_ОбщегоНазначенияКлиентСервер.ДобавитьДеньКДате(ДатаНачала, ф - 1);
					_Движение.Сотрудник = Стр.Сотрудник;
					_Движение.Локация = Стр.Локация;
					
				КонецЕсли;
				
			КонецЦикла;
				
		КонецЦикла;
		
	КонецЕсли;
	
	Движения.гхб_СпискиДоступаНаЛокацию.Записать();
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = ?(ПеренесеноИзБазыРесурсов, "МР", "СД");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
